OpenNuvoton/ISPTool/Firmwares/NUC472_442BSP/Library/UsbHostLib/SOURCE/Core/usbh_core.c
/*
 * drivers/usb/usb.c
 *
 * (C) Copyright Linus Torvalds 1999
 * (C) Copyright Johannes Erdfelt 1999
 * (C) Copyright Andreas Gal 1999
 * (C) Copyright Gregory P. Smith 1999
 * (C) Copyright Deti Fliegl 1999 (new USB architecture)
 * (C) Copyright Randy Dunlap 2000
 * (C) Copyright David Brownell 2000 (kernel hotplug, usb_device_id)
 * (C) Copyright Yggdrasil Computing, Inc. 2000
 *     (usb_device_id matching changes by Adam J. Richter)
 *
 * NOTE! This is not actually a driver at all, rather this is
 * just a collection of helper routines that implement the
 * generic USB things that the real drivers can use..
 *
 * Think of this as a "USB library" rather than anything else.
 * It should be considered a slave, with no callbacks. Callbacks
 * are evil.
 *
 * $Id: usb.c,v 1.53 2000/01/14 16:19:09 acher Exp $
 */

/**************************************************************************//**
 * @file     usbh_core.c
 * @version  V1.00
 * $Revision: 18 $
 * $Date: 15/05/22 10:44a $
 * @brief    NUC472/NUC442 MCU USB Host Library core
 *
 * @note
 * Copyright (C) 2013 Nuvoton Technology Corp. All rights reserved.
*****************************************************************************/
#include <stdio.h>
#include <string.h>

#include "NUC472_442.h"
#include "usbh_core.h"
#include "usbh_ohci.h"

/** @addtogroup NUC472_442_Device_Driver NUC472/NUC442 Device Driver
  @{
*/

/** @addtogroup NUC472_442_USBH_Driver USBH Driver
  @{
*/

/** @addtogroup NUC472_442_USBH_EXPORTED_FUNCTIONS USBH Exported Functions
  @{
*/


/// @cond HIDDEN_SYMBOLS

extern USB_DEV_T g_dev_pool[DEV_MAX_NUM];
extern uint8_t  dev_alloc_mark[DEV_MAX_NUM];

static volatile uint32_t  g_devmap;

/*
 * We have a per-interface "registered driver" list.
 */
LIST_HEAD(_UsbDriverList);
LIST_HEAD(_UsbBusList);

/// @endcond


/**
  * @brief     Register a device driver to USB Host Core driver
  * @param[in] new_driver: The USB device driver.
  * @return    Success or not.
  * @retval    0  Success
  * @retval    otherwise  Failed
  */
int USBH_RegisterDriver(USB_DRIVER_T *new_driver)
{
    /* Add it to the list of known drivers */
    list_add_tail(&new_driver->driver_list, &_UsbDriverList);
    return 0;
}

/// @cond HIDDEN_SYMBOLS

const USB_DEV_ID_T  *usb_match_id(USB_DEV_T *dev, USB_IF_DESC_T *intf,
                                  const USB_DEV_ID_T *id)
{
    /* proc_connectinfo in devio.c may call us with id == NULL. */
    if (id == NULL)
        return NULL;

    /*
     *  It is important to check that id->driver_info is nonzero,
     *  since an entry that is all zeroes except for a nonzero
     *  id->driver_info is the way to create an entry that indicates
     *  that the driver want to examine every device and interface.
     */
    for (; id->idVendor || id->bDeviceClass || id->bInterfaceClass || id->driver_info; id++) {
        if ((id->match_flags & USB_DEVICE_ID_MATCH_VENDOR) &&
                (id->idVendor != dev->descriptor.idVendor))
            continue;

        if ((id->match_flags & USB_DEVICE_ID_MATCH_PRODUCT) &&
                (id->idProduct != dev->descriptor.idProduct))
            continue;

        /* No need to test id->bcdDevice_lo != 0, since 0 is never
           greater than any unsigned number. */
        if ((id->match_flags & USB_DEVICE_ID_MATCH_DEV_LO) &&
                (id->bcdDevice_lo > dev->descriptor.bcdDevice))
            continue;

        if ((id->match_flags & USB_DEVICE_ID_MATCH_DEV_HI) &&
                (id->bcdDevice_hi < dev->descriptor.bcdDevice))
            continue;

        if ((id->match_flags & USB_DEVICE_ID_MATCH_DEV_CLASS) &&
                (id->bDeviceClass != dev->descriptor.bDeviceClass))
            continue;

        if ((id->match_flags & USB_DEVICE_ID_MATCH_DEV_SUBCLASS) &&
                (id->bDeviceSubClass!= dev->descriptor.bDeviceSubClass))
            continue;

        if ((id->match_flags & USB_DEVICE_ID_MATCH_DEV_PROTOCOL) &&
                (id->bDeviceProtocol != dev->descriptor.bDeviceProtocol))
            continue;

        if ((id->match_flags & USB_DEVICE_ID_MATCH_INT_CLASS) &&
                (id->bInterfaceClass != intf->bInterfaceClass))
            continue;

        if ((id->match_flags & USB_DEVICE_ID_MATCH_INT_SUBCLASS) &&
                (id->bInterfaceSubClass != intf->bInterfaceSubClass))
            continue;

        if ((id->match_flags & USB_DEVICE_ID_MATCH_INT_PROTOCOL) &&
                (id->bInterfaceProtocol != intf->bInterfaceProtocol))
            continue;
        return id;
    }
    return NULL;
}


/*
 *  This entry point gets called for each new device.
 *
 *  We now walk the list of registered USB drivers,
 *  looking for one that will accept this interface.
 *
 *  "New Style" drivers use a table describing the devices and interfaces
 *  they handle.  Those tables are available to user mode tools deciding
 *  whether to load driver modules for a new device.
 *
 *  The probe return value is changed to be a private pointer.  This way
 *  the drivers don't have to dig around in our structures to set the
 *  private pointer if they only need one interface.
 *
 *  Returns: 0 if a driver accepted the interface, -1 otherwise
 */
static int  usb_find_interface_driver(USB_DEV_T *dev, USB_IF_DESC_T *intf)
{
    USB_LIST_T          *tmp;
    const USB_DEV_ID_T  *id;
    USB_DRIVER_T        *driver;
    int                 i, found;

    for (tmp = _UsbDriverList.next; tmp != &_UsbDriverList;) { /* search through the driver list */
        driver = list_entry(tmp, USB_DRIVER_T, driver_list);
        tmp = tmp->next;

        id = driver->id_table;
        id = usb_match_id(dev, intf, id);
        if (id) {
            if (driver->probe(dev, intf, id) == 0) {
                /*
                 *  Add driver to driver list of this device.
                 */
                for (found = 0, i = 0; i < dev->driver_cnt; i++)
                    if (dev->driver[i] == driver) found = 1;

                if (!found) {
                    if (dev->driver_cnt >= MAX_DRIVER_PER_DEV) {
                        USB_error("Driver overrun for one device!\n");
                        return USB_ERR_NOMEM;
                    }
                    dev->driver[dev->driver_cnt] = driver;
                    dev->driver_cnt++;
                    USB_debug("Deivce bind driver count %d\n", dev->driver_cnt);
                    return 0;
                }
            }
        }
    }
    if (dev->driver_cnt == 0)
        USB_warning("No matching driver!!\n");
    return -1;
}

/// @endcond HIDDEN_SYMBOLS

/**
  * @brief    Submit an URB to USB core for transfer data.
  * @param[in] urb The USB transfer request to be processed.
  * @return    Success or not.
  * @retval    0  Success
  * @retval    otherwise  Failed
  */
int  USBH_SubmitUrb(URB_T *urb)
{
    if (urb && urb->dev)
        return urb->dev->bus->op->submit_urb(urb);
    else {
        return USB_ERR_NODEV;
    }
}


/**
  * @brief    Cancel an URB which has been submit to USB core.
  * @param[in]  urb The USB to be canceled.
  * @return    Success or not.
  * @retval    0  Success
  * @retval    otherwise  Failed
  */
int  USBH_UnlinkUrb(URB_T *urb)
{
    if (urb && urb->dev)
        return urb->dev->bus->op->unlink_urb(urb);
    else
        return USB_ERR_NODEV;
}


/// @cond HIDDEN_SYMBOLS

/*-------------------------------------------------------------------*
 *                     COMPLETION HANDLERS                           *
 *-------------------------------------------------------------------*/

