OpenNuvoton/ISPTool/Firmwares/NUC472_442BSP/Library/UsbHostLib/SOURCE/Core/usbh_core.c
static volatile int _Event_UrbCompleted;

/*-------------------------------------------------------------------*
 * completion handler for compatibility wrappers (sync control/bulk) *
 *-------------------------------------------------------------------*/
static void ctrl_msg_complete(URB_T *urb)
{
    _Event_UrbCompleted = 1;
}

static int get_ctrl_msg_signal()
{
    return _Event_UrbCompleted;
}
static void clr_ctrl_msg_signal()
{
    _Event_UrbCompleted = 0;
}



/*-------------------------------------------------------------------*
 *                         COMPATIBILITY STUFF                       *
 *-------------------------------------------------------------------*/
/*  Starts urb and waits for completion or timeout */
static int  usb_start_wait_urb(URB_T *urb, int timeout, int* actual_length)
{
    volatile int  t0;
    int   status;

    timeout /= 10000;
    if (timeout == 0) timeout = 100;

    clr_ctrl_msg_signal();

    status = USBH_SubmitUrb(urb);
    if (status)
        return status;

#if 1
    for (t0 = 0; t0 < 0x100000; t0++) {
        if (get_ctrl_msg_signal())
            break;
    }

    if (t0 >= 0x100000)
        urb->status = USB_ERR_INPROGRESS;
    else
        urb->status = 0;
#else
    t0 = sysGetTicks(TIMER0);
    while (sysGetTicks(TIMER0) - t0 < timeout) {
        if (get_ctrl_msg_signal())
            break;
    }

    if (sysGetTicks(TIMER0) - t0 >= timeout)
        urb->status = USB_ERR_INPROGRESS;
    else
        urb->status = 0;
#endif

    if (urb->status == USB_ERR_INPROGRESS) {
        /* timeout */
        USB_warning("usb_control/bulk_msg: timeout\n");
        USBH_UnlinkUrb(urb);     /* remove urb safely */
        status = USB_ERR_TIMEOUT;
    } else
        status = urb->status;

    if (actual_length)
        *actual_length = urb->actual_length;

    return status;
}


/*-------------------------------------------------------------------*/
// returns status (negative) or length (positive)
static int  usb_internal_control_msg(USB_DEV_T *usb_dev, uint32_t pipe,
                                     DEV_REQ_T *cmd,  void *data, int len, int timeout)
{
    URB_T   urb;
    int     retv;
    int     length;

    FILL_CONTROL_URB(&urb, usb_dev, pipe, (uint8_t*)cmd, data, len,  /* build urb */
                     ctrl_msg_complete, 0);

    retv = usb_start_wait_urb(&urb, timeout, &length);
    if (retv < 0)
        return retv;
    else
        return length;
}

/// @endcond HIDDEN_SYMBOLS


/**
 *  @brief  Execute a control transfer.
 *  @param[in] dev    Pointer to the usb device to send the message to.
 *  @param[in] pipe   Endpoint pipe to send the message to.
 *  @param[in] request   USB message request value
 *  @param[in] requesttype  USB message request type value
 *  @param[in] value  USB message value
 *  @param[in] index  USB message index value
 *  @param[in,out] data   Memory buffer of the data to be send with this transfer or to hold the data received from this transfer.
 *  @param[in] size   Length in bytes of the data to send.
 *  @param[in] timeout Time in millisecond to wait for the message to complete before timing out (if 0 the wait is forever).
 *  @return   Data transfer length or error code.
 *  @retval   >=0  The actual bytes of data be transferred.
 *  @retval   Otherwise  Failed
 *
 *  This function sends a simple control message to a specified endpoint
 *  and waits for the message to complete, or timeout.
 *
 *  If successful, it returns 0, otherwise a negative error number.
 *
 *  Don't use this function from within an interrupt context, like a
 *  bottom half handler.  If you need a asynchronous message, or need to send
 *  a message from within interrupt context, use USBH_SubmitUrb()
 */
int  USBH_SendCtrlMsg(USB_DEV_T *dev, uint32_t pipe, uint8_t request,
                      uint8_t requesttype,  uint16_t value, uint16_t index, void *data,
                      uint16_t size, int timeout)
{
    DEV_REQ_T   dr;

    dr.requesttype = requesttype;
    dr.request = request;
    dr.value = value;
    dr.index = index;
    dr.length = size;
    return usb_internal_control_msg(dev, pipe, &dr, (uint8_t *)data, size, timeout);
}


/**
  * @brief  Execute a bulk transfer.
 *  @param[in] usb_dev  Pointer to the usb device to send the message to.
 *  @param[in] pipe   Endpoint pipe to send the message to.
 *  @param[in,out] data   Pointer to the data to send or to receive.
 *  @param[in] len    Length in bytes of the data to send or receive.
 *  @param[out] actual_length Actual length of data transferred.
 *  @param[in]  timeout  Time in millisecond to wait for the message to complete before timing out (if 0 the wait is forever).
 *  @return   Data transfer length or error code.
 *  @retval   >=0  The actual bytes of data be transferred.
 *  @retval   Otherwise  Failed
 *
 *  This function sends a simple bulk message to a specified endpoint
 *  and waits for the message to complete, or timeout.
 *
 *  If successful, it returns 0, otherwise a negative error number.
 *  The number of actual bytes transferred will be placed in the
 *  actual_timeout parameter.
 *
 *  Don't use this function from within an interrupt context, like a
 *  bottom half handler.  If you need a asynchronous message, or need to
 *  send a message from within interrupt context, use USBH_SubmitUrb()
 */
int  USBH_SendBulkMsg(USB_DEV_T *usb_dev, uint32_t pipe,
                      void *data, int len, int *actual_length, int timeout)
{
    URB_T  urb;

    FILL_BULK_URB(&urb,usb_dev,pipe,(uint8_t *)data,len,   /* build urb */
                  ctrl_msg_complete, 0);

    return usb_start_wait_urb(&urb, timeout, actual_length);
}

/// @cond HIDDEN_SYMBOLS

int usb_maxpacket(USB_DEV_T *dev, uint32_t pipe, int out)
{
    int         i;
    int         ep_addr;

    ep_addr =  (((pipe) >> 15) & 0xf) | (pipe & 0x80);

    if ((ep_addr == 0) || (ep_addr == 0x80))
        return dev->ep_list[0].wMaxPacketSize;

    for (i = 0; i < dev->ep_list_cnt; i++) {
        if ((dev->ep_list[i].cfgno == dev->act_config) &&
                (dev->ep_list[i].bEndpointAddress == ep_addr)) {
            return dev->ep_list[i].wMaxPacketSize;
        }
    }
    USB_error("usb_maxpacket - endpoint %x not found!!\n", ep_addr);
    return 64;
}


