OpenNuvoton/ISPTool/Firmwares/NUC472_442BSP/Library/UsbHostLib/SOURCE/Core/usbh_core.c
static int  usb_parse_endpoint(USB_DEV_T *dev, int cfg_value, USB_IF_DESC_T *ifp, uint8_t *buffer, int size)
{
    USB_EP_DESC_T   endpoint;
    USB_DESC_HDR_T  *header;
    EP_INFO_T       *ep_info;
    int             parsed = 0, numskipped;

    header = (USB_DESC_HDR_T *)buffer;
    memcpy((uint8_t *)&endpoint, buffer, sizeof(USB_EP_DESC_T));

    /* Everything should be fine being passed into here, but we sanity */
    if (header->bLength > size) {
        USB_error("Error! - ran out of descriptors parsing");
        return -1;
    }

    if (header->bDescriptorType != USB_DT_ENDPOINT) {
        USB_warning("Warning! - unexpected descriptor 0x%X, expecting endpoint descriptor, type 0x%X",
                    endpoint.bDescriptorType, USB_DT_ENDPOINT);
        return parsed;
    }

    if (dev->ep_list_cnt < MAX_ENDPOINTS) {
        ep_info = &dev->ep_list[dev->ep_list_cnt];
        ep_info->cfgno = cfg_value;
        ep_info->ifnum = ifp->bInterfaceNumber;
        ep_info->altno = ifp->bAlternateSetting;
        ep_info->bEndpointAddress = endpoint.bEndpointAddress;
        ep_info->bmAttributes = endpoint.bmAttributes;
        ep_info->bInterval = endpoint.bInterval;
        ep_info->wMaxPacketSize = endpoint.wMaxPacketSize;
        if ((ep_info->bmAttributes & USB_ENDPOINT_XFERTYPE_MASK) == USB_ENDPOINT_XFER_BULK) {
            if (ep_info->wMaxPacketSize > 64) {
                USB_debug("Endpoint %x wMaxPacketSize is %d bytes, force to change as 64 bytes!\n",
                          endpoint.bEndpointAddress, endpoint.wMaxPacketSize);
                ep_info->wMaxPacketSize = 64;
            }
        }
        dev->ep_list_cnt++;
        //USB_debug("Add endpoint 0x%x - %d %d %d, max_pkt = %d\n", ep_info->bEndpointAddress, ep_info->cfgno,
        //           ep_info->ifnum, ep_info->altno, ep_info->wMaxPacketSize);
    } else {
        USB_error("Too many endpoints!\n");
    }

    buffer += header->bLength;
    size -= header->bLength;
    parsed += header->bLength;

    /* Skip over the rest of the Class Specific or Vendor Specific descriptors */
    numskipped = 0;
    while (size >= sizeof(USB_DESC_HDR_T)) {
        header = (USB_DESC_HDR_T *)buffer;

        if (header->bLength < 2) {
            USB_error("Error! - invalid descriptor length of %d\n", header->bLength);
            return -1;
        }

        /* If we find another descriptor which is at or below us */
        /*  in the descriptor heirarchy then we're done  */
        if ((header->bDescriptorType == USB_DT_ENDPOINT) ||
                (header->bDescriptorType == USB_DT_INTERFACE) ||
                (header->bDescriptorType == USB_DT_CONFIG) ||
                (header->bDescriptorType == USB_DT_DEVICE))
            break;
        USB_info("skipping descriptor 0x%X\n", header->bDescriptorType);
        numskipped++;

        buffer += header->bLength;
        size -= header->bLength;
        parsed += header->bLength;
    }

    if (numskipped)
        USB_warning("Skipped %d class/vendor specific endpoint descriptors\n", numskipped);

    return parsed;
}


static int  usb_parse_interface(USB_DEV_T *dev, int cfg_value, uint8_t *buffer, int size)
{
    int     i, numskipped, retval, parsed = 0;
    USB_DESC_HDR_T  *header;
    USB_IF_DESC_T   ifp;

#ifdef USB_VERBOSE_DEBUG
    //HexDumpBuffer("usb_parse_interface", (uint8_t *)buffer, size);
#endif

    while (size > 0) {
        memcpy((char *)&ifp, buffer, USB_DT_INTERFACE_SIZE);

        /* Skip over the interface */
        buffer += ifp.bLength;
        parsed += ifp.bLength;
        size -= ifp.bLength;

        numskipped = 0;

        /*
         *  Skip over any interface, class or vendor descriptors
         *  ¦b parsing interface descriptors ªº¹Lµ{¤¤, ­Yµo²{ class descriptors
         *  ©̠vendor descriptors, ´Nª½±µ skip ¤§, ¤£°µ parsing
         */
        while (size >= sizeof(USB_DESC_HDR_T)) {
            header = (USB_DESC_HDR_T *)buffer;

            if (header->bLength < 2) {
                USB_error("Invalid descriptor length of %d\n", header->bLength);
                return -1;
            }

            /* If we find another descriptor which is at or below */
            /*  us in the descriptor heirarchy then return */
            if ((header->bDescriptorType == USB_DT_INTERFACE) ||
                    (header->bDescriptorType == USB_DT_ENDPOINT) ||
                    (header->bDescriptorType == USB_DT_CONFIG) ||
                    (header->bDescriptorType == USB_DT_DEVICE))
                break;

            USB_info("skipping descriptor 0x%X\n", header->bDescriptorType);
            numskipped++;
            buffer += header->bLength;
            parsed += header->bLength;
            size -= header->bLength;
        }

        if (numskipped) {
            USB_warning("skipped %d class/vendor specific interface descriptors\n", numskipped);
        }

        /* Did we hit an unexpected descriptor? */
        header = (USB_DESC_HDR_T *)buffer;
        if ((size >= sizeof(USB_DESC_HDR_T)) &&
                ((header->bDescriptorType == USB_DT_CONFIG) ||
                 (header->bDescriptorType == USB_DT_DEVICE))) {
            USB_warning("parsing interface - hit an unexpected descriptor!\n");
            return parsed;
        }

        if (ifp.bNumEndpoints > USB_MAXENDPOINTS) {
            USB_warning("Warning - illegal endpoint number %d\n", ifp.bNumEndpoints);
            return -1;
        }

        /* fixed by YCHuang, 2002.03.13, ifp.bNumEndpoints number may be zero */
        if (ifp.bNumEndpoints > 0) {
            for (i = 0; i < ifp.bNumEndpoints; i++) {
                header = (USB_DESC_HDR_T *)buffer;
                if (header->bLength > size) {
                    USB_error("Error - ran out of descriptors parsing");
                    return -1;
                }

#ifdef DUMP_DEV_DESCRIPTORS
                usbh_dump_ep_descriptor((USB_EP_DESC_T *)buffer);
#endif
                retval = usb_parse_endpoint(dev, cfg_value, &ifp, buffer, size);
                if (retval < 0)
                    return retval;

