OpenNuvoton/ISPTool/Firmwares/NUC472_442BSP/Library/UsbHostLib/SOURCE/Core/usbh_core.c
    return 0;

err:
    dev->descriptor.bNumConfigurations = cfgno;
    return result;
}

/*
 * usbh_translate_string:
 *      returns string length (> 0) or error (< 0)
 */
int  usbh_translate_string(USB_DEV_T *dev, int index, char *buf, int size)
{
    int         err = 0;
    uint32_t    u, idx;
    uint8_t     tbuf[256];

    if (size == 0 || !buf || !index)
        return USB_ERR_INVAL;
    buf[0] = 0;

    /* get langid for strings if it's not yet known */
    if (!dev->have_langid) {
        err = usbh_get_string_descriptor(dev, 0, 0, tbuf, 4);
        if (err < 0) {
            USB_error("usbh_translate_string - error getting string descriptor 0 (error=%d)\n", err);
            goto errout;
        } else if (tbuf[0] < 4) {
            USB_error("usbh_translate_string - string descriptor 0 too short\n");
            err = USB_ERR_INVAL;
            goto errout;
        } else {
            dev->have_langid = -1;
            dev->string_langid = tbuf[2] | (tbuf[3]<< 8);
            /* always use the first langid listed */
            USB_info("USB device number %d default language ID 0x%x\n",
                     dev->devnum, dev->string_langid);
        }
    }

    /* YCHuang, added for W99683, prevent halt */
    if ((dev->descriptor.idVendor == 0x416) && (dev->descriptor.idProduct == 0x9683)) {
        USB_warning("??? Skip usbh_get_string_descriptor, 255\n");
        goto errout;
    }


    /*
     * Just ask for a maximum length string and then take the length
     * that was returned.
     */
    err = usbh_get_string_descriptor(dev, dev->string_langid, index, tbuf, 255);
    if (err < 0)
        goto errout;

    size--;                     /* leave room for trailing NULL char in output buffer */
    for (idx = 0, u = 2; u < err; u += 2) {
        if (idx >= size)
            break;
        if (tbuf[u+1])           /* high byte */
            buf[idx++] = '?';    /* non-ASCII character */
        else
            buf[idx++] = tbuf[u];
    }
    buf[idx] = 0;
    err = idx;

errout:
    return err;
}



/*
 *  By the time we get here, the device has gotten a new device ID
 *  and is in the default state. We need to identify the thing and
 *  get the ball rolling..
 *
 *  Returns 0 for success, != 0 for error.
 */
int  usbh_settle_new_device(USB_DEV_T *dev)
{
    int     err;

    USB_info("[USBH] Enter usbh_settle_new_device() ...\n");
    /*
     *  USB v1.1 5.5.3
     *  We read the first 8 bytes from the device descriptor to get to
     *  the bMaxPacketSize0 field. Then we set the maximum packet size
     *  for the control pipe, and retrieve the rest
     */
    dev->ep_list[0].bEndpointAddress = 0;;
    dev->ep_list[0].wMaxPacketSize = 8;
    dev->ep_list_cnt = 1;

    err = usbh_set_address(dev);
    if (err < 0) {
        USB_error("USB device not accepting new address=%d (error=%d)\n", dev->devnum, err);
        g_devmap &= ~(1 << dev->devnum);
        dev->devnum = -1;
        return 1;
    }

    usbh_mdelay(10);    /* Let the SET_ADDRESS settle */

    memset((char *)&dev->descriptor, 0, 8);

    err = USBH_GetDescriptor(dev, USB_DT_DEVICE, 0, &dev->descriptor, 8);
    if (err < 8) {
        USB_debug("USBH_GetDescriptor failed!!\n");
        if (err < 0)
            USB_error("USB device not responding, giving up (error=%d)\n", err);
        else
            USB_error("USB device descriptor short read (expected %i, got %i)\n", 8, err);
        g_devmap &= ~(1 << dev->devnum);
        dev->devnum = -1;
        return 1;
    }

    dev->ep_list[0].wMaxPacketSize = dev->descriptor.bMaxPacketSize0;

    err = usbh_get_device_descriptor(dev);
    if (err < sizeof(dev->descriptor)) {
        if (err < 0)
            USB_error("unable to get device descriptor (error=%d)\n", err);
        else
            USB_error("USB device descriptor short read (expected %i, got %i)\n",
                      sizeof(dev->descriptor), err);

        g_devmap &= ~(1 << dev->devnum);
        dev->devnum = -1;
        return USB_ERR_INVAL;
    }

#ifdef DUMP_DEV_DESCRIPTORS
    usbh_dump_device_descriptor(&dev->descriptor);
#endif

    err = usbh_settle_configuration(dev);
    if (err < 0) {
        USB_error("Unable to get device %d configuration (error=%d)\n", dev->devnum, err);
        g_devmap &= ~(1 << dev->devnum);
        dev->devnum = -1;
        usbh_free_device(dev);
        return 1;
    }

#ifdef USB_VERBOSE_DEBUG
    if (dev->descriptor.iManufacturer)
        usbh_print_usb_string(dev, "Manufacturer", dev->descriptor.iManufacturer);
    if (dev->descriptor.iProduct)
        usbh_print_usb_string(dev, "Product", dev->descriptor.iProduct);
    if (dev->descriptor.iSerialNumber)
        usbh_print_usb_string(dev, "SerialNumber", dev->descriptor.iSerialNumber);
#endif
    return 0;
}

/// @endcond HIDDEN_SYMBOLS


/**
  * @brief    Open USB Host controller function
  * @return   Success or not.
  * @retval   0   Success
  * @retval   Otherwise  Failed
  */
int USBH_Open(void)
{
    volatile int  loop;

    //USBH->HcMiscControl |= 0x8;     /* over current setting */
    USBH->HcMiscControl &= ~0x8;      /* over current setting */

    usbh_init_memory();

    /*
     * Init global variables
     */
    g_devmap = 0;

    ENABLE_USB_INT();

    usbh_init_hub_driver();

#ifdef SUPPORT_HID_CLASS
#endif

#ifdef SUPPORT_UMAS_CLASS
#endif

#ifdef SUPPORT_UVC_CLASS
#endif

#ifdef SUPPORT_UAC_CLASS
#endif

#ifdef SUPPORT_CDC_CLASS
#endif

    if (usbh_init_ohci() < 0) {
        USB_debug("OHCI init failed!\n");
        return -1;
    }

    return 0;
}


/**
  * @brief    Disable USB Host controller function
  * @return   Success or not.
  * @retval   0   Success
  * @retval   Otherwise   Failed
  */
int32_t USBH_Close(void)
{
    DISABLE_USB_INT();

    USBH->HcRhStatus = USBH_HcRhStatus_LPS_Msk;

    usbh_init_memory();

    return 0;
}

/**
  * @brief    Suspend USB Host Controller and devices
  * @return   Success or not.
  * @retval   0  Success
  * @retval   Otherwise   Failed
  */
int32_t USBH_Suspend(void)
{
    int         i;
    USB_DEV_T   *dev;

    /* Set feature Device Remote Wakeup to all devices */
    for (i = 0; i < DEV_MAX_NUM; i++) {
        if (dev_alloc_mark[i]) {
            dev = &g_dev_pool[i];
            USBH_SendCtrlMsg(dev, usb_sndctrlpipe(dev, 0),
                             USB_REQ_SET_FEATURE, 0x00, 0x0001, 0x0000, NULL, 0x0000, HZ * SET_TIMEOUT);
        }
    }

    /* set port suspend if connected */
    if (USBH->HcRhPortStatus[0] & 0x1)
        USBH->HcRhPortStatus[0] = 0x4;

    if (USBH->HcRhPortStatus[1] & 0x1)
        USBH->HcRhPortStatus[1] = 0x4;

    /* enable Device Remote Wakeup */
    USBH->HcRhStatus |= USBH_HcRhStatus_DRWE_Msk;

    /* enable USBH RHSC interrupt for system wakeup */
    USBH->HcInterruptEnable =  USBH_HcInterruptEnable_RHSC_Msk | USBH_HcInterruptEnable_RD_Msk;

    /* set Host Controller enter suspend state */
    USBH->HcControl = (USBH->HcControl & ~USBH_HcControl_HCFS_Msk) | (3 << USBH_HcControl_HCFS_Pos);

    return 0;
}


/**
  * @brief    Resume USB Host controller and devices
  * @return   Success or not.
  * @retval   0   Success
  * @retval   Otherwise   Failed
  */
int32_t USBH_Resume(void)
{
    USBH->HcControl = (USBH->HcControl & ~USBH_HcControl_HCFS_Msk) | (1 << USBH_HcControl_HCFS_Pos);
    USBH->HcControl = (USBH->HcControl & ~USBH_HcControl_HCFS_Msk) | (2 << USBH_HcControl_HCFS_Pos);

    if (USBH->HcRhPortStatus[0] & 0x4)
        USBH->HcRhPortStatus[0] = 0x8;
    if (USBH->HcRhPortStatus[1] & 0x4)
        USBH->HcRhPortStatus[1] = 0x8;

    return 0;
}


/*@}*/ /* end of group NUC472_442_USBH_EXPORTED_FUNCTIONS */

/*@}*/ /* end of group NUC472_442_USBH_Driver */

/*@}*/ /* end of group NUC472_442_Device_Driver */

/*** (C) COPYRIGHT 2014 Nuvoton Technology Corp. ***/

